app/controllers/sessions_controller.rb

	def get_tweets
		# Create/get user
		username = params[:username]
		user = User.find_by_username(username) || User.create(:username => username)
		user = {:id => user.id, :username => user.username, :scores => user.scores.collect{|s| s.value}}

		# Generate random tweets
		num_tweets = 150
		random_tweets = []
		trend_queries = twitter_client.trends.collect{|t| t.query}

		trend_queries.each do |query|
			tweets = twitter_client.search(query, :lang => "en", :count => 100).statuses

			tweets.map! {|t| {
				:name => t.user.name,
				:username => t.user.screen_name,
				:avatar => t.profile_image_url,
				:content => t.text,
				:time => t.created_at.strftime("%b %d"),
				:points => -10
---
INSERT INTO `users` (`created_at`, `updated_at`, `username`) VALUES ('2013-10-25 05:42:05', '2013-10-25 05:42:05', 'jonny')
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'jonny' LIMIT 1
SELECT `scores`.* FROM `scores` WHERE `scores`.`user_id` = 3
SELECT `users`.* FROM `users` ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `scores` (`created_at`, `updated_at`, `user_id`, `value`) VALUES ('2013-10-25 05:54:14', '2013-10-25 05:54:14', 3, 100)