app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
INSERT INTO `scores` (`created_at`, `updated_at`, `user_id`, `value`) VALUES ('2013-10-25 06:36:56', '2013-10-25 06:36:56', 4, -10)
SELECT `scores`.* FROM `scores` WHERE `scores`.`user_id` = 4
---
	def update
		user = User.find(params[:id])
		score = params[:score]
		Score.create(:user_id => user.id, :value => score)
		user = {:id => user.id, :username => user.username, :scores => user.scores.collect{|s| s.value}}